# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binaries
brew 'awscli'
brew 'zsh' # Latest Zsh version
brew 'git'
brew 'grep'
brew 'httpie'
brew 'jq' # Used for spatie/visit
brew 'mackup'
brew 'mas' # Mac App Store manager

# Development
brew 'node'
brew 'nvm'
brew 'yarn'
brew 'tfenv'

# Apps
cask 'iterm2'
cask '1password'
cask 'caffeine'
cask 'docker'
cask 'firefox'
cask 'google-chrome'
cask 'slack'
cask 'telegram-desktop'
cask 'transmit'
cask 'protonvpn'
cask 'visual-studio-code'
cask 'zoom'
cask 'bluejeans'
cask 'jetbrains-toolbox'
cask 'direnv'
cask 'kind'

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'

# Fonts
cask 'font-fira-code'
cask 'font-jetbrains-mono'
