# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binaries
brew 'zsh' # Latest Zsh version
brew 'fish'
brew 'git'
brew 'grep'
brew 'httpie'
brew 'jq' # Used for spatie/visit
brew 'yq'

# Development
brew 'node'
brew 'nvm'
brew 'yarn'
brew 'tfenv'
brew 'direnv'
brew 'kind'
brew 'wget'
brew 'kubectx'
brew 'inetutils'

# Apps
cask 'iterm2'
cask '1password'
cask 'caffeine'
cask 'docker'
cask 'firefox'
cask 'google-chrome'
cask 'slack'
cask 'transmit'
cask 'protonvpn'
cask 'visual-studio-code'
cask 'zoom'
cask 'jetbrains-toolbox'
cask 'obsidian'
cask 'openlens'
cask 'studio-3t'

# Fonts
cask 'font-fira-code'
cask 'font-jetbrains-mono'
